# RenderPlantTrimHeight Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RenderPlantTrimHeight Property
ParameterTypeId Class See Also
---
"Plant Trim Height"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RenderPlantTrimHeight { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RenderPlantTrimHeight As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RenderPlantTrimHeight {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace